IOsonata/TaktOS/Benchmark/ThreadMetric /nRF54L15/ThreadMetricBenchmarkTaktOS_PreemptiveScheduling_nRF54L15/src/tm_port.cpp
#include <stdint.h>
#include <stddef.h>

extern "C" {
#include "tm_api.h"
}

#include "TaktOS.h"
#include "TaktOSThread.h"
#include "TaktOSSem.h"
#include "TaktOSQueue.h"

// MDK peripheral structs — NRF_UARTE30_S and NRF_UARTE_Type
#include "nrf.h"


// -----------------------------------------------------------------------------
// TaktOS porting layer for the official Thread-Metric test suite.
//
// Target: bare-metal Cortex-M33 / nRF54L15 application core
// Output: UART via UARTE30 EasyDMA (P0.00 by default on the nRF54L15 DK VCOM)
// Tick  : 100 Hz (10 ms), matching Thread-Metric requirements
//
// Important behavior notes:
//   - Thread-Metric priorities are inverted relative to TaktOS:
//       TM 1 (highest)  -> TaktOS 31
//       TM 31 (lowest)  -> TaktOS 1
//   - tm_thread_create() semantics are "create suspended". TaktOS does not
//     natively support pre-start resume/suspend, so this port uses a two-phase
//     materialization model during tm_initialize().
//   - Queue and memory-pool semantics match the official harness expectations.
//   - tm_cause_interrupt() uses SWI00 (IRQ 28) via STIR.
// -----------------------------------------------------------------------------

#define TM_TAKTOS_MAX_THREADS      10
#define TM_TAKTOS_MAX_QUEUES       1
#define TM_TAKTOS_MAX_SEMAPHORES   1
#define TM_TAKTOS_MAX_POOLS        1

#define TM_TAKTOS_STACK_BYTES      1024u
#define TM_TAKTOS_TICK_HZ          1000u
#define TM_TAKTOS_TICK_CLOCK_HZ    SystemCoreClock


#define TM_TAKTOS_QUEUE_DEPTH      10u
#define TM_TAKTOS_QUEUE_MSG_SIZE   (4u * sizeof(unsigned long))

#define TM_BLOCK_SIZE              128u
#define TM_POOL_SIZE               2048u
#define TM_BLOCK_COUNT             (TM_POOL_SIZE / TM_BLOCK_SIZE)


#define UART_TX_PIN          0u
#define UART_BAUDRATE_115200 0x01D7E000u

// NVIC / system handler priority registers
#define SCB_SHPR3                  (*(volatile uint32_t*)0xE000ED20u)
#define NVIC_ISER0                 (*(volatile uint32_t*)0xE000E100u)
#define NVIC_IPR                   ((volatile uint8_t*)0xE000E400u)
#define NVIC_STIR                  (*(volatile uint32_t*)0xE000EF00u)
#define SW_IRQ_N                   28u

struct TmThreadDesc {
    bool            allocated;
    bool            resume_before_start;
    uint8_t         tm_priority;
    void          (*entry)(void);
    TaktOSThread_t *handle;
    uint8_t         mem[TAKTOS_THREAD_STACK_SIZE(TM_TAKTOS_STACK_BYTES)] __attribute__((aligned(4)));
};

static TmThreadDesc  g_threads[TM_TAKTOS_MAX_THREADS];
static bool          g_kernel_started = false;

static TaktOSQueue_t g_queues[TM_TAKTOS_MAX_QUEUES];
static uint8_t       g_queue_storage[TM_TAKTOS_MAX_QUEUES]
                                   [TM_TAKTOS_QUEUE_DEPTH * TM_TAKTOS_QUEUE_MSG_SIZE]
                                   __attribute__((aligned(4)));
static bool          g_queue_created[TM_TAKTOS_MAX_QUEUES];

static TaktOSSem_t   g_semaphores[TM_TAKTOS_MAX_SEMAPHORES];
static bool          g_semaphore_created[TM_TAKTOS_MAX_SEMAPHORES];

static uint8_t       g_pool_area[TM_TAKTOS_MAX_POOLS][TM_POOL_SIZE] __attribute__((aligned(sizeof(void*))));
static void         *g_pool_free[TM_TAKTOS_MAX_POOLS];
static bool          g_pool_created[TM_TAKTOS_MAX_POOLS];

static char          g_uart_buf[128];

extern "C" void tm_interrupt_handler(void) __attribute__((weak));
extern "C" void tm_interrupt_preemption_handler(void) __attribute__((weak));
extern "C" void tm_interrupt_handler(void) {}
extern "C" void tm_interrupt_preemption_handler(void) {}

static inline uint8_t tm_to_taktos_priority(int tm_priority)
{
    if (tm_priority < 1)  tm_priority = 1;
    if (tm_priority > 31) tm_priority = 31;
    return (uint8_t)(32 - tm_priority);
}

static void tm_uart_send(const char *buf, uint32_t len)
{
    NRF_UARTE_Type *uart = NRF_UARTE30_S;

    while (len > 0u) {
        uint32_t chunk = (len > sizeof(g_uart_buf)) ? (uint32_t)sizeof(g_uart_buf) : len;
        for (uint32_t i = 0u; i < chunk; ++i) {
            g_uart_buf[i] = buf[i];
        }
        uart->EVENTS_DMA.TX.END = 0u;
        uart->DMA.TX.PTR        = (uint32_t)(uintptr_t)g_uart_buf;
        uart->DMA.TX.MAXCNT     = chunk;
        uart->TASKS_DMA.TX.START = 1u;
        while (!uart->EVENTS_DMA.TX.END) {}
        uart->TASKS_DMA.TX.STOP = 1u;
        buf += chunk;
        len -= chunk;
    }
}

extern "C" void tm_hw_console_init(void)
{
    NRF_UARTE_Type *uart = NRF_UARTE30_S;
    uart->PSEL.TXD   = UART_TX_PIN;
    uart->BAUDRATE   = UART_BAUDRATE_115200;
    uart->CONFIG     = 0u;
    uart->ENABLE     = 8u;
}

static void tm_set_system_handler_priorities(void)
{
    // PendSV = SHPR3[23:16], SysTick = SHPR3[31:24]
    uint32_t v = SCB_SHPR3;
    v &= 0x0000FFFFu;
    v |= (0xFFu << 16);
    v |= (0xFFu << 24);
    SCB_SHPR3 = v;
}

static void tm_enable_software_interrupt(void)
{
    // IRQ28 above PendSV/SysTick so the ISR runs first, then PendSV tail-chains.
    NVIC_IPR[SW_IRQ_N] = 0xC0u;
    NVIC_ISER0 = (1u << SW_IRQ_N);
}

static void tm_thread_trampoline(void *arg)
{
    int id = (int)(uintptr_t)arg;
    if (id >= 0 && id < TM_TAKTOS_MAX_THREADS && g_threads[id].entry) {
        g_threads[id].entry();
    }
    for (;;) {}
}

static int tm_materialize_thread(int thread_id)
{
    TmThreadDesc *t;

    if (thread_id < 0 || thread_id >= TM_TAKTOS_MAX_THREADS)
        return TM_ERROR;

    t = &g_threads[thread_id];
    if (!t->allocated)
        return TM_ERROR;

    if (t->handle != NULL)
        return TM_SUCCESS;

    t->handle = TaktOSThreadCreate(t->mem,
                                   (uint32_t)sizeof(t->mem),
                                   tm_thread_trampoline,
                                   (void*)(uintptr_t)thread_id,
                                   tm_to_taktos_priority(t->tm_priority));
    return (t->handle != NULL) ? TM_SUCCESS : TM_ERROR;
}

static void tm_materialize_all_threads(void)
{
    int i;
    for (i = 0; i < TM_TAKTOS_MAX_THREADS; ++i) {
        if (g_threads[i].allocated && tm_materialize_thread(i) != TM_SUCCESS) {
            tm_check_fail("FATAL: TaktOS thread creation failed\n");
        }
    }
    for (i = 0; i < TM_TAKTOS_MAX_THREADS; ++i) {
        if (g_threads[i].allocated && !g_threads[i].resume_before_start) {
            if (TaktOSThreadSuspend(g_threads[i].handle) != TAKTOS_OK) {
                tm_check_fail("FATAL: initial thread suspend failed\n");
            }
        }
    }
}

extern "C" void tm_initialize(void (*test_initialization_function)(void))
{
    int i;

    for (i = 0; i < TM_TAKTOS_MAX_THREADS; ++i) {
        g_threads[i].allocated = false;
        g_threads[i].resume_before_start = false;
        g_threads[i].tm_priority = 31u;
        g_threads[i].entry = NULL;
        g_threads[i].handle = NULL;
    }
    for (i = 0; i < TM_TAKTOS_MAX_QUEUES; ++i) {
        g_queue_created[i] = false;
    }
    for (i = 0; i < TM_TAKTOS_MAX_SEMAPHORES; ++i) {
        g_semaphore_created[i] = false;
    }
    for (i = 0; i < TM_TAKTOS_MAX_POOLS; ++i) {
        g_pool_created[i] = false;
        g_pool_free[i] = NULL;
    }

    g_kernel_started = false;

    tm_set_system_handler_priorities();
    if (TaktOSInit(TM_TAKTOS_TICK_CLOCK_HZ, TM_TAKTOS_TICK_HZ, TAKTOS_TICK_CLOCK_PROCESSOR) != TAKTOS_OK) {
        tm_check_fail("FATAL: TaktOSInit failed\n");
    }

    tm_hw_console_init();

    test_initialization_function();

    tm_materialize_all_threads();
    tm_enable_software_interrupt();
    g_kernel_started = true;

    TaktOSStart();
    for (;;) {}
}

extern "C" int tm_thread_create(int thread_id, int priority, void (*entry_function)(void))
{
    TmThreadDesc *t;

    if (thread_id < 0 || thread_id >= TM_TAKTOS_MAX_THREADS ||
        priority < 1 || priority > 31 || entry_function == NULL)
        return TM_ERROR;

    t = &g_threads[thread_id];
    t->allocated = true;
    t->resume_before_start = false;
    t->tm_priority = (uint8_t)priority;
    t->entry = entry_function;

    if (g_kernel_started) {
        if (tm_materialize_thread(thread_id) != TM_SUCCESS)
            return TM_ERROR;
        return (TaktOSThreadSuspend(t->handle) == TAKTOS_OK) ? TM_SUCCESS : TM_ERROR;
    }

    return TM_SUCCESS;
}

extern "C" int tm_thread_resume(int thread_id)
{
    if (thread_id < 0 || thread_id >= TM_TAKTOS_MAX_THREADS || !g_threads[thread_id].allocated)
        return TM_ERROR;

    if (!g_kernel_started) {
        g_threads[thread_id].resume_before_start = true;
        return TM_SUCCESS;
    }

    return (TaktOSThreadResume(g_threads[thread_id].handle) == TAKTOS_OK) ? TM_SUCCESS : TM_ERROR;
}

extern "C" int tm_thread_suspend(int thread_id)
{
    if (thread_id < 0 || thread_id >= TM_TAKTOS_MAX_THREADS || !g_threads[thread_id].allocated)
        return TM_ERROR;

    if (!g_kernel_started) {
        g_threads[thread_id].resume_before_start = false;
        return TM_SUCCESS;
    }

    return (TaktOSThreadSuspend(g_threads[thread_id].handle) == TAKTOS_OK) ? TM_SUCCESS : TM_ERROR;
}

extern "C" void tm_thread_relinquish(void)
{
    TaktOSThreadYield();
}

extern "C" void tm_thread_sleep(int seconds)
{
    uint32_t ticks = (seconds <= 0) ? 0u : (uint32_t)seconds * TM_TAKTOS_TICK_HZ;
    (void)TaktOSThreadSleep(TaktOSCurrentThread(), ticks);
}

extern "C" int tm_queue_create(int queue_id)
{
    if (queue_id < 0 || queue_id >= TM_TAKTOS_MAX_QUEUES)
        return TM_ERROR;

    if (TaktOSQueueInit(&g_queues[queue_id],
                        g_queue_storage[queue_id],
                        TM_TAKTOS_QUEUE_MSG_SIZE,
                        TM_TAKTOS_QUEUE_DEPTH) != TAKTOS_OK) {
        return TM_ERROR;
    }

    g_queue_created[queue_id] = true;
    return TM_SUCCESS;
}

extern "C" int tm_queue_send(int queue_id, unsigned long *message_ptr)
{
    if (queue_id < 0 || queue_id >= TM_TAKTOS_MAX_QUEUES || !g_queue_created[queue_id] || message_ptr == NULL)
        return TM_ERROR;

    return (TaktOSQueueSend(&g_queues[queue_id], message_ptr, false) == TAKTOS_OK) ? TM_SUCCESS : TM_ERROR;
}

extern "C" int tm_queue_receive(int queue_id, unsigned long *message_ptr)
{
    if (queue_id < 0 || queue_id >= TM_TAKTOS_MAX_QUEUES || !g_queue_created[queue_id] || message_ptr == NULL)
        return TM_ERROR;

    return (TaktOSQueueReceive(&g_queues[queue_id], message_ptr, false, TAKTOS_NO_WAIT) == TAKTOS_OK) ? TM_SUCCESS : TM_ERROR;
}

extern "C" int tm_semaphore_create(int semaphore_id)
{
    if (semaphore_id < 0 || semaphore_id >= TM_TAKTOS_MAX_SEMAPHORES)
        return TM_ERROR;

    if (TaktOSSemInit(&g_semaphores[semaphore_id], 1u, 1u) != TAKTOS_OK)
        return TM_ERROR;

    g_semaphore_created[semaphore_id] = true;
    return TM_SUCCESS;
}

extern "C" int tm_semaphore_get(int semaphore_id)
{
    if (semaphore_id < 0 || semaphore_id >= TM_TAKTOS_MAX_SEMAPHORES || !g_semaphore_created[semaphore_id])
        return TM_ERROR;

    return (TaktOSSemTake(&g_semaphores[semaphore_id], false, TAKTOS_NO_WAIT) == TAKTOS_OK) ? TM_SUCCESS : TM_ERROR;
}

extern "C" int tm_semaphore_put(int semaphore_id)
{
    if (semaphore_id < 0 || semaphore_id >= TM_TAKTOS_MAX_SEMAPHORES || !g_semaphore_created[semaphore_id])
        return TM_ERROR;

    return (TaktOSSemGive(&g_semaphores[semaphore_id], false) == TAKTOS_OK) ? TM_SUCCESS : TM_ERROR;
}

extern "C" int tm_memory_pool_create(int pool_id)
{
    int i;
    uint8_t *base;

    if (pool_id < 0 || pool_id >= TM_TAKTOS_MAX_POOLS)
        return TM_ERROR;

    base = g_pool_area[pool_id];
    g_pool_free[pool_id] = (void*)base;

    for (i = 0; i < (int)TM_BLOCK_COUNT - 1; ++i) {
        void **block = (void**)(base + (uint32_t)i * TM_BLOCK_SIZE);
        *block = (void*)(base + (uint32_t)(i + 1) * TM_BLOCK_SIZE);
    }
    {
        void **last = (void**)(base + (uint32_t)(TM_BLOCK_COUNT - 1) * TM_BLOCK_SIZE);
        *last = NULL;
    }

    g_pool_created[pool_id] = true;
    return TM_SUCCESS;
}

extern "C" int tm_memory_pool_allocate(int pool_id, unsigned char **memory_ptr)
{
    void *block;

    if (pool_id < 0 || pool_id >= TM_TAKTOS_MAX_POOLS || !g_pool_created[pool_id] || memory_ptr == NULL)
        return TM_ERROR;

    block = g_pool_free[pool_id];
    if (block == NULL)
        return TM_ERROR;

    g_pool_free[pool_id] = *((void**)block);
    *memory_ptr = (unsigned char*)block;
    return TM_SUCCESS;
}

extern "C" int tm_memory_pool_deallocate(int pool_id, unsigned char *memory_ptr)
{
    if (pool_id < 0 || pool_id >= TM_TAKTOS_MAX_POOLS || !g_pool_created[pool_id] || memory_ptr == NULL)
        return TM_ERROR;

    *((void**)memory_ptr) = g_pool_free[pool_id];
    g_pool_free[pool_id] = (void*)memory_ptr;
    return TM_SUCCESS;
}

extern "C" void tm_cause_interrupt(void)
{
    NVIC_STIR = SW_IRQ_N;
}

// -----------------------------------------------------------------------------
// UART output — blocking via tm_uart_send.
// Reports print every 30 s so blocking time is irrelevant to benchmark accuracy.
// -----------------------------------------------------------------------------
extern "C" void tm_putchar(int c)
{
    char ch = (char)c;
    tm_uart_send(&ch, 1u);
}

extern "C" void SWI00_IRQHandler(void)
{
    tm_interrupt_handler();
    tm_interrupt_preemption_handler();
}
